Revit 2027 API
ParameterTypeId.RbsCurvetypeDefaultHorizontalBendParam Property
 "Horizontal Bend"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsCurvetypeDefaultHorizontalBendParam { get; }
Public Shared ReadOnly Property RbsCurvetypeDefaultHorizontalBendParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsCurvetypeDefaultHorizontalBendParam {
	ForgeTypeId^ get ();
}
static member RbsCurvetypeDefaultHorizontalBendParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace